package jp.ac.it_college.std.flickfighter;

import java.util.Random;

public class WordBook {

    public static String[][] wordBook(){
        String[][] word = new String[10][];
        word[0] = new String[]{"あうあう","あいあい","あい","あああ","いえ","いう","おいえ","おういえ","おい","あお","ええ","えい","ういお","おう","えいえいおー"};
        word[1] = new String[]{"かき","かい","かかお","かいが","かくい","かきくけこ","こくご","けいご","いいこ","えかき","いか","かいき","きく","くき","ごかく"};
        word[2] = new String[]{"さき","ささ","きさい","さしすせそ","すかい","すいか","すし","しきさい","そすう","せいそう","さしえ","そうじき","えくささいず","そうさい","かくせいき"};
        word[3] = new String[]{"たちつてと","とうだい","ちかてつどう","どせい","せいどう","どうじおし","かたくそうさく","てすとたいさく","かだい","だいどうげい","だかいさく","ちっそく","たんこう","こうだい","どくさいせいじ"};
        word[4] = new String[]{"なにぬねの","なっとう","のうかがく","ないないてい","かいねこ","ななかいだて","えすえぬえす","のうどう","なかおち","ないぞう","ながねぎ","いなりずし","なきおとし","こなおとし","あなごのつくだに"};
        word[5] = new String[]{"はひふへほ","はいけい","だいほうさく","ほうそくせい","ほっかいどう","ふっそかこう","ぱいぷいす","はっくつ","はいたてき","はとぽっぽ","はっかざい","ほっとどっぐ","さとうきびばたけ","いふうどうどう","ほうそうじこ"};
        word[6] = new String[]{"まみむめも","もうしあげます","まつのき","みそにこみ","むだばなし","もえないごみ","ごもくそば","まほうつかい","まかだみあなっつ","ごまどうふ","しものせき","かがみもち","まつばづえ","むかしばなし","まぐねしうむ"};
        word[7] = new String[]{"やさいいため","しょうゆさし","ようしょうき","やっきょく","やくざいし","ゆうきゅうきゅうか","ゆうとうせい","よていひょう","ひょうしょうじょう","やきゅうじょう","しょうぼうしゃ","ゆうゆうじてき","ゆくえふめい","しょうがくせい","きゅうきゅうびょうとう"};
        word[8] = new String[]{"ごまふあざらし","あるごりずむ","くれおぱとら","らいふすたいる","りゅうがくせい","りょうりきょうしつ","れいきゃくざい","ろうごしせつ","るりいろのぐらす","ろうどうしせつ","しりめつれつ","まだがすかる","くろっくしゅはすう","れべるあっぷ","れいがいしょり"};
        word[9] = new String[]{"ぷらっとふぉーむ","わんだーらんど","らんどせるかばー","ばんぐらでぃっしゅ","あいでんてぃてぃー","あいんしゅたいん","いんでぺんでんと","うんてんめんきょ","えんしんぶんりき","おおばんくるわせ","わしんとんしゅう","わいどすくりーん","ぷーちんだいとうりょう","ろしあんるーれっと","くりすますぷれぜんと"};
        return word;
    }

    public static String randomWordView(int i){
        Random rand = new Random();
        String[][] tmp = wordBook();
        return tmp[rand.nextInt(i)][rand.nextInt(15)];
    }
}
